import React from "react";
import { SlControlPlay } from "react-icons/sl";
import { MdOutlineContentCopy } from "react-icons/md";
import { FiBookOpen } from "react-icons/fi";
import { CiBookmark } from "react-icons/ci";

export const navData = {
  mainData: [
    { id: 1, name: `الأذكار`, href: `/azkar` },
    { id: 2, name: `مواقيت الصلاة`, href: `/prayer-times` },
    { id: 3, name: `الحديث`, href: "/hadith" },
  ],
  quranData: [
    { id: 1, name: `الاستماع إلى القرآن`, href: `/quran/listen-to-quran` },
    { id: 2, name: `قراءة القرآن`, href: `/quran/reading-quran` },
    { id: 3, name: `الآيات المحفوظة`, href: `/quran/saved-ayahs` },
    { id: 4, name: `بحث في القرآن`, href: `/quran/search-quran` },
  ],
};

export const azkar = {
  "أذكار الصباح": [
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description:
        "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
      reference: "",
      content:
        "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description:
        "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
      reference: "",
      content:
        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ",
    },
    {
      category: "أذكار الصباح",
      count: "4",
      description: "من قالها أعتقه الله من النار.",
      reference: "",
      content:
        "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
    },
    {
      category: "أذكار الصباح",
      count: "7",
      description: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
      reference: "",
      content:
        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "لم يضره من الله شيء.",
      reference: "",
      content:
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
    },
    {
      category: "أذكار الصباح",
      count: "10",
      description: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
      reference: "",
      content: "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
    },
    {
      category: "أذكار الصباح",
      count: "3",
      description: "",
      reference: "",
      content:
        "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
    },
    {
      category: "أذكار الصباح",
      count: "1",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
    },
    {
      category: "أذكار الصباح",
      count: "100",
      description:
        "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
      reference: "",
      content:
        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
    },
    {
      category: "أذكار الصباح",
      count: "100",
      description:
        "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
      reference: "",
      content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    },
    {
      category: "أذكار الصباح",
      count: "100",
      description:
        "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.",
      reference: "",
      content: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
    },
  ],
  "أذكار المساء": [
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description:
        "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
      reference: "",
      content:
        "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description:
        "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
      reference: "",
      content:
        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
    },
    {
      category: "أذكار المساء",
      count: "04",
      description: "من قالها أعتقه الله من النار.",
      reference: "",
      content:
        "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "من قالها حين يمسى أدى شكر يومه.",
      reference: "",
      content:
        "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
    },
    {
      category: "أذكار المساء",
      count: "07",
      description: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
      reference: "",
      content:
        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "لم يضره من الله شيء.",
      reference: "",
      content:
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
    },
    {
      category: "أذكار المساء",
      count: "10",
      description: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
      reference: "",
      content: "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
    },
    {
      category: "أذكار المساء",
      count: "03",
      description: "",
      reference: "",
      content:
        "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
    },
    {
      category: "أذكار المساء",
      count: "100",
      description:
        "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
      reference: "",
      content:
        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
    },
    {
      category: "أذكار المساء",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
    },
    {
      category: "أذكار المساء",
      count: "100",
      description:
        "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
      reference: "",
      content: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    },
  ],
  "أذكار بعد السلام من الصلاة المفروضة": [
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "01",
      description: "",
      reference: "",
      content:
        "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.\nاللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "01",
      description: "",
      reference: "",
      content:
        "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "01",
      description: "",
      reference: "",
      content:
        "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "33",
      description: "",
      reference: "",
      content: "سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "01",
      description: "",
      reference: "",
      content:
        "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "10",
      description: "عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح.",
      reference: "",
      content:
        "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "01",
      description: "بَعْد السّلامِ من صَلاةِ الفَجْر.",
      reference: "",
      content:
        "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "07",
      description: "بعد صلاة الصبح والمغرب.",
      reference: "",
      content: "اللَّهُمَّ أَجِرْنِي مِنْ النَّار.",
    },
    {
      category: "أذكار بعد السلام من الصلاة المفروضة",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.",
    },
  ],
  تسابيح: [
    {
      category: "تسابيح",
      count: "100",
      description: "يكتب له ألف حسنة أو يحط عنه ألف خطيئة.",
      reference: "",
      content: "سُبْحَانَ اللَّهِ",
    },
    {
      category: "تسابيح",
      count: "100",
      description:
        "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
      reference: "",
      content: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.",
      reference: "",
      content: "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "غرست له نخلة في الجنة.",
      reference: "",
      content: "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "ثقيلتان في الميزان حبيبتان إلى الرحمن.",
      reference: "",
      content: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
    },
    {
      category: "تسابيح",
      count: "100",
      description:
        "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
      reference: "",
      content:
        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "كنز من كنوز الجنة.",
      reference: "",
      content: "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "تملأ ميزان العبد بالحسنات.",
      reference: "",
      content: "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
      reference: "",
      content: "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "لفعل الرسول صلى الله عليه وسلم.",
      reference: "",
      content: "أستغفر الله",
    },
    {
      category: "تسابيح",
      count: "100",
      description:
        "أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.",
      reference: "",
      content:
        "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "أفضل الذكر لا إله إلاّ الله.",
      reference: "",
      content: "لَا إِلَهَ إِلَّا اللَّهُ",
    },
    {
      category: "تسابيح",
      count: "100",
      description:
        "من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.",
      reference: "",
      content: "الْلَّهُ أَكْبَرُ",
    },
    {
      category: "تسابيح",
      count: "100",
      description: "خير الدنيا والآخرة",
      reference: "",
      content:
        "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.",
    },
    {
      category: "تسابيح",
      count: "100",
      description:
        'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ".',
      reference: "",
      content:
        "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.",
    },
    {
      category: "تسابيح",
      count: "100",
      description:
        "في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم.",
      reference: "",
      content:
        "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    },
  ],
  "أذكار النوم": [
    {
      category: "أذكار النوم",
      count: "01",
      description: "",
      reference: "",
      content:
        "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.",
    },
    {
      category: "أذكار النوم",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة.",
    },
    {
      category: "أذكار النوم",
      count: "03",
      description: "",
      reference: "",
      content: "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك.",
    },
    {
      category: "أذكار النوم",
      count: "01",
      description: "",
      reference: "",
      content: "بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا.",
    },
    {
      category: "أذكار النوم",
      count: "01",
      description: "",
      reference: "",
      content:
        "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.",
    },
    {
      category: "أذكار النوم",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم .",
    },
    {
      category: "أذكار النوم",
      count: "01",
      description: "",
      reference: "",
      content:
        "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت.",
    },
    {
      category: "أذكار النوم",
      count: "33",
      description: "",
      reference: "",
      content: "سُبْحَانَ اللَّهِ.",
    },
    {
      category: "أذكار النوم",
      count: "33",
      description: "",
      reference: "",
      content: "الْحَمْدُ لِلَّهِ.",
    },
    {
      category: "أذكار النوم",
      count: "34",
      description: "",
      reference: "",
      content: "اللَّهُ أَكْبَرُ.",
    },
  ],
  "أذكار الاستيقاظ": [
    {
      category: "أذكار الاستيقاظ",
      count: "01",
      description: "",
      reference: "",
      content:
        "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور.",
    },
    {
      category: "أذكار الاستيقاظ",
      count: "01",
      description: "",
      reference: "",
      content:
        "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه.",
    },
    {
      category: "أذكار الاستيقاظ",
      count: "01",
      description: "",
      reference: "",
      content:
        "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي.",
    },
  ],
  "أدعية قرآنية": [
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [البقرة - 201].",
      content:
        '"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ". [البقرة - 201].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [البقرة - 250].",
      content:
        '"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ". [البقرة - 250].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [البقرة- 286].",
      content:
        '"رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ". [البقرة- 286].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [آل عمران - 8].",
      content:
        '"رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ". [آل عمران - 8].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [آل عمران - 16].",
      content:
        '"رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ". [آل عمران - 16].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [آل عمران - 38].",
      content:
        '"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء". [آل عمران - 38].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [آل عمران - 53].",
      content:
        '"رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ". [آل عمران - 53].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [آل عمران - 147].",
      content:
        '"ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ". [آل عمران - 147].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [آل عمران -  191-194].",
      content:
        '"رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ". [آل عمران -  191-194].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الأعراف - 23].",
      content:
        '"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ". [الأعراف - 23].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الأعراف - 47].",
      content:
        '"رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ". [الأعراف - 47].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الأعراف - 126].",
      content:
        '"رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ". [الأعراف - 126].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [التوبة - 129].",
      content:
        '"حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ". [التوبة - 129].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [يونس - 85-86].",
      content:
        '"رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ". [يونس - 85-86].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [هود - 47].",
      content:
        '"رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ". [هود - 47].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [إبرهيم - 40].",
      content:
        '"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء". [إبرهيم - 40].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [إبرهيم - 41].",
      content:
        '"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ". [إبرهيم - 41].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الإسراء - 80].",
      content:
        '"رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا". [الإسراء - 80].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الكهف - 10].",
      content:
        '"رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا". [الكهف - 10].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [طه - 25-28].",
      content:
        '"رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي". [طه - 25-28].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [طه - 114].",
      content: '"رَّبِّ زِدْنِي عِلْمًا". [طه - 114].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الأنبياء - 87].",
      content:
        '"لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ". [الأنبياء - 87].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [الأنبياء - 89].",
      content:
        '"رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ". [الأنبياء - 89].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [المؤمنون - 97-98].",
      content:
        '"رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ". [المؤمنون - 97-98].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [المؤمنون - 109].",
      content:
        '"رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ". [المؤمنون - 109].',
    },
    {
      category: "أدعية قرآنية",
      count: "01",
      description: "",
      reference: ". [المؤمنون - 118].",
      content:
        '"رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ". [المؤمنون - 118].',
    },
  ],
  "أدعية الأنبياء": [
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "آدم علية السلام.",
      reference: ". [الأعراف - 23].",
      content:
        '"رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ". [الأعراف - 23].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "نوح علية السلام.",
      reference: ". [نوح - 28].",
      content:
        '"رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا". [نوح - 28]." رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ". [هود - 47]."رَّبِّ أَنزِلْنِي مُنزَلاً مُّبَارَكاً وَأَنتَ خَيْرُ الْمُنزِلِينَ". [المؤمنون - 29].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "إبراهيم علية السلام.",
      reference: ". [هود - 47].",
      content:
        '"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ (127) رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ (128)". [البقرة - 127-128]."رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ (40) رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ (41)". [إبراهيم - 40-41]."رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ (83) وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ (84) وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ (85)". [الشعراء - 83-85]."رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ (4) رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ  إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ (5)". [الممتحنة - 4-5]."رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ". [الصافات - 100].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "هود علية السلام.",
      reference: ". [المؤمنون - 29].",
      content:
        '"إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ". [هود - 56].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "لوط علية السلام.",
      reference: ". [البقرة - 127-128].",
      content:
        '"رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ". [العنكبوت - 30]."رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ". [الشعراء - 169].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "يوسف علية السلام.",
      reference: ". [إبراهيم - 40-41].",
      content:
        '"فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ". [يوسف - 101].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "شعيب علية السلام.",
      reference: ". [الشعراء - 83-85].",
      content:
        '"وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْماً عَلَى اللّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ". [الأعراف - 89].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "موسى علية السلام.",
      reference: ". [الممتحنة - 4-5].",
      content:
        '"رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي". [القصص - 16]."رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيراً لِّلْمُجْرِمِينَ". [القصص - 17]."رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ". [القصص - 24]."رَبِّ اشْرَحْ لِي صَدْرِي (25) وَيَسِّرْ لِي أَمْرِي (26) وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي (27) يَفْقَهُوا قَوْلِي (28)". [طه - 25-28].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "أيوب علية السلام.",
      reference: '". [الصافات - 100].',
      content:
        '"أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ". [الأنبياء - 83].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "سليمان علية السلام.",
      reference: ". [هود - 56].",
      content:
        '"رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ". [النمل - 19].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "يونس علية السلام.",
      reference: ". [العنكبوت - 30].",
      content:
        '" لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ". [الأنبياء - 87].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "زكريا علية السلام.",
      reference: ". [الشعراء - 169].",
      content:
        '"رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء". [آل عمران - 38]."رَبِّ لَا تَذَرْنِي فَرْداً وَأَنتَ خَيْرُ الْوَارِثِينَ". [الأنبياء - 89].',
    },
    {
      category: "أدعية الأنبياء",
      count: "01",
      description: "يعقوب علية السلام.",
      reference: ". [يوسف - 101].",
      content:
        '"إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ". [يوسف - 86].',
    },
  ],
};
export const azkarCategories = [
  `أذكار الصباح`,
  `أذكار المساء`,
  `أذكار بعد السلام من الصلاة المفروضة`,
  `تسابيح`,
  `أذكار النوم`,
  `أذكار الاستيقاظ`,
  `أدعية قرآنية`,
  `أدعية الأنبياء`,
];

export const HadithBooks = [
  {
    name: "سنن أبي داود",
    id: "abu-daud",
    available: 4419,
  },
  {
    name: "مسند الإمام أحمد",
    id: "ahmad",
    available: 4305,
  },
  {
    name: "صحيح البخاري",
    id: "bukhari",
    available: 6638,
  },
  {
    name: "سنن الدارمي",
    id: "darimi",
    available: 2949,
  },
  {
    name: "سنن ابن ماجه",
    id: "ibnu-majah",
    available: 4285,
  },
  {
    name: "موطأ الإمام مالك",
    id: "malik",
    available: 1587,
  },
  {
    name: "صحيح مسلم",
    id: "muslim",
    available: 4930,
  },
  {
    name: "سنن النسائي",
    id: "nasai",
    available: 5364,
  },
  {
    name: "سنن الترمذي",
    id: "tirmidzi",
    available: 3625,
  },
];
export const hadithSamples = [
  {
    id: 1,
    arabic:
      "إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى",
    reference: "صحيح البخاري",
  },
  {
    id: 2,
    arabic:
      "مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ",
    reference: "صحيح البخاري",
  },
  {
    id: 3,
    arabic: "خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ",
    reference: "صحيح البخاري",
  },
  {
    id: 4,
    arabic: "الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ",
    reference: "صحيح البخاري",
  },
];

export const MonthsInArabic = {
  January: "يناير",
  February: "فبراير",
  March: "مارس",
  April: "أبريل",
  May: "مايو",
  June: "يونيو",
  July: "يوليو",
  August: "أغسطس",
  September: "سبتمبر",
  October: "أكتوبر",
  November: "نوفمبر",
  December: "ديسمبر",
};
export const PrayerTimesInArabic = {
  Fajr: "الفجر",
  Dhuhr: "الظهر",
  Asr: "العصر",
  Maghrib: "المغرب",
  Isha: "العشاء",
};

export const QuranSurahs = [
  { number: 1, name: "ٱلْفَاتِحَةُ", revelation: "مكية", ayahs: 7 },
  { number: 2, name: "ٱلْبَقَرَةُ", revelation: "مدنية", ayahs: 286 },
  { number: 3, name: "آلِ عِمْرَانَ", revelation: "مدنية", ayahs: 200 },
  { number: 4, name: "ٱلنِّسَاءُ", revelation: "مدنية", ayahs: 176 },
  { number: 5, name: "ٱلْمَائِدَةُ", revelation: "مدنية", ayahs: 120 },
  { number: 6, name: "ٱلْأَنْعَامُ", revelation: "مكية", ayahs: 165 },
  { number: 7, name: "ٱلْأَعْرَافُ", revelation: "مكية", ayahs: 206 },
  { number: 8, name: "ٱلْأَنْفَالُ", revelation: "مدنية", ayahs: 75 },
  { number: 9, name: "ٱلتَّوْبَةُ", revelation: "مدنية", ayahs: 129 },
  { number: 10, name: "يُونُسُ", revelation: "مكية", ayahs: 109 },
  { number: 11, name: "هُودٌ", revelation: "مكية", ayahs: 123 },
  { number: 12, name: "يُوسُفَ", revelation: "مكية", ayahs: 111 },
  { number: 13, name: "ٱلرَّعْدُ", revelation: "مدنية", ayahs: 43 },
  { number: 14, name: "إِبْرَاهِيمَ", revelation: "مكية", ayahs: 52 },
  { number: 15, name: "ٱلْحِجْرُ", revelation: "مكية", ayahs: 99 },
  { number: 16, name: "ٱلنَّحْلُ", revelation: "مكية", ayahs: 128 },
  { number: 17, name: "ٱلْإِسْرَاءُ", revelation: "مكية", ayahs: 111 },
  { number: 18, name: "ٱلْكَهْفُ", revelation: "مكية", ayahs: 110 },
  { number: 19, name: "مَرْيَمَ", revelation: "مكية", ayahs: 98 },
  { number: 20, name: "طٰهٰ", revelation: "مكية", ayahs: 135 },
  { number: 21, name: "ٱلْأَنْبِيَآءُ", revelation: "مكية", ayahs: 112 },
  { number: 22, name: "ٱلْحَجُّ", revelation: "مدنية", ayahs: 78 },
  { number: 23, name: "ٱلْمُؤْمِنُونَ", revelation: "مكية", ayahs: 118 },
  { number: 24, name: "ٱلنُّورُ", revelation: "مدنية", ayahs: 64 },
  { number: 25, name: "ٱلْفُرْقَانُ", revelation: "مكية", ayahs: 77 },
  { number: 26, name: "ٱلشُّعَرَآءُ", revelation: "مكية", ayahs: 227 },
  { number: 27, name: "ٱلنَّمْلُ", revelation: "مكية", ayahs: 93 },
  { number: 28, name: "ٱلْقَصَصُ", revelation: "مكية", ayahs: 88 },
  { number: 29, name: "ٱلْعَنْكَبُوتُ", revelation: "مكية", ayahs: 69 },
  { number: 30, name: "ٱلرُّومُ", revelation: "مكية", ayahs: 60 },
  { number: 31, name: "لُقْمَانُ", revelation: "مكية", ayahs: 34 },
  { number: 32, name: "ٱلسَّجْدَةُ", revelation: "مكية", ayahs: 30 },
  { number: 33, name: "ٱلْأَحْزَابُ", revelation: "مدنية", ayahs: 73 },
  { number: 34, name: "سَبَإٍ", revelation: "مكية", ayahs: 54 },
  { number: 35, name: "فَاطِرٌ", revelation: "مكية", ayahs: 45 },
  { number: 36, name: "يٰسٓ", revelation: "مكية", ayahs: 83 },
  { number: 37, name: "ٱلصَّافَّاتُ", revelation: "مكية", ayahs: 182 },
  { number: 38, name: "صٓ", revelation: "مكية", ayahs: 88 },
  { number: 39, name: "ٱلزُّمَرُ", revelation: "مكية", ayahs: 75 },
  { number: 40, name: "غَافِرٌ", revelation: "مكية", ayahs: 85 },
  { number: 41, name: "فُصِّلَتْ", revelation: "مكية", ayahs: 54 },
  { number: 42, name: "ٱلشُّورَىٰ", revelation: "مكية", ayahs: 53 },
  { number: 43, name: "ٱلزُّخْرُفُ", revelation: "مكية", ayahs: 89 },
  { number: 44, name: "ٱلدُّخَانُ", revelation: "مكية", ayahs: 59 },
  { number: 45, name: "ٱلْجَاثِيَةُ", revelation: "مكية", ayahs: 37 },
  { number: 46, name: "ٱلْأَحْقَافُ", revelation: "مكية", ayahs: 35 },
  { number: 47, name: "مُحَمَّدٌ", revelation: "مدنية", ayahs: 38 },
  { number: 48, name: "ٱلْفَتْحُ", revelation: "مدنية", ayahs: 29 },
  { number: 49, name: "ٱلْحُجُرَاتُ", revelation: "مدنية", ayahs: 18 },
  { number: 50, name: "قٓ", revelation: "مكية", ayahs: 45 },
  { number: 51, name: "ٱلذَّارِيَاتُ", revelation: "مكية", ayahs: 60 },
  { number: 52, name: "ٱلطُّورُ", revelation: "مكية", ayahs: 49 },
  { number: 53, name: "ٱلنَّجْمُ", revelation: "مكية", ayahs: 62 },
  { number: 54, name: "ٱلْقَمَرُ", revelation: "مكية", ayahs: 55 },
  { number: 55, name: "ٱلرَّحْمَٰنُ", revelation: "مدنية", ayahs: 78 },
  { number: 56, name: "ٱلْوَاقِعَةُ", revelation: "مكية", ayahs: 96 },
  { number: 57, name: "ٱلْحَدِيدُ", revelation: "مدنية", ayahs: 29 },
  { number: 58, name: "ٱلْمُجَادِلَةُ", revelation: "مدنية", ayahs: 22 },
  { number: 59, name: "ٱلْحَشْرُ", revelation: "مدنية", ayahs: 24 },
  { number: 60, name: "ٱلْمُمْتَحَنَةُ", revelation: "مدنية", ayahs: 13 },
  { number: 61, name: "ٱلصَّفُّ", revelation: "مدنية", ayahs: 14 },
  { number: 62, name: "ٱلْجُمُعَةُ", revelation: "مدنية", ayahs: 11 },
  { number: 63, name: "ٱلْمُنَافِقُونَ", revelation: "مدنية", ayahs: 11 },
  { number: 64, name: "ٱلتَّغَابُنُ", revelation: "مدنية", ayahs: 18 },
  { number: 65, name: "ٱلطَّلَاقُ", revelation: "مدنية", ayahs: 12 },
  { number: 66, name: "ٱلتَّحْرِيمُ", revelation: "مدنية", ayahs: 12 },
  { number: 67, name: "ٱلْمُلْكُ", revelation: "مكية", ayahs: 30 },
  { number: 68, name: "ٱلْقَلَمُ", revelation: "مكية", ayahs: 52 },
  { number: 69, name: "ٱلْحَاقَّةُ", revelation: "مكية", ayahs: 52 },
  { number: 70, name: "ٱلْمَعَارِجُ", revelation: "مكية", ayahs: 44 },
  { number: 71, name: "نُوحٌ", revelation: "مكية", ayahs: 28 },
  { number: 72, name: "ٱلْجِنُّ", revelation: "مكية", ayahs: 28 },
  { number: 73, name: "ٱلْمُزَّمِّلُ", revelation: "مكية", ayahs: 20 },
  { number: 74, name: "ٱلْمُدَّثِّرُ", revelation: "مكية", ayahs: 56 },
  { number: 75, name: "ٱلْقِيَامَةُ", revelation: "مكية", ayahs: 40 },
  { number: 76, name: "ٱلْإِنسَانُ", revelation: "مدنية", ayahs: 31 },
  { number: 77, name: "ٱلْمُرْسَلَاتُ", revelation: "مكية", ayahs: 50 },
  { number: 78, name: "ٱلنَّبَإُ", revelation: "مكية", ayahs: 40 },
  { number: 79, name: "ٱلنَّازِعَاتُ", revelation: "مكية", ayahs: 46 },
  { number: 80, name: "عَبَسَ", revelation: "مكية", ayahs: 42 },
  { number: 81, name: "ٱلتَّكْوِيرُ", revelation: "مكية", ayahs: 29 },
  { number: 82, name: "ٱلْإِنفِطَارُ", revelation: "مكية", ayahs: 19 },
  { number: 83, name: "ٱلْمُطَفِّفِينَ", revelation: "مكية", ayahs: 36 },
  { number: 84, name: "ٱلْإِنشِقَاقُ", revelation: "مكية", ayahs: 25 },
  { number: 85, name: "ٱلْبُرُوجُ", revelation: "مكية", ayahs: 22 },
  { number: 86, name: "ٱلطَّارِقُ", revelation: "مكية", ayahs: 17 },
  { number: 87, name: "ٱلْأَعْلَىٰ", revelation: "مكية", ayahs: 19 },
  { number: 88, name: "ٱلْغَاشِيَةُ", revelation: "مكية", ayahs: 26 },
  { number: 89, name: "ٱلْفَجْرُ", revelation: "مكية", ayahs: 30 },
  { number: 90, name: "ٱلْبَلَدُ", revelation: "مكية", ayahs: 20 },
  { number: 91, name: "ٱلشَّمْسُ", revelation: "مكية", ayahs: 15 },
  { number: 92, name: "ٱللَّيْلُ", revelation: "مكية", ayahs: 21 },
  { number: 93, name: "ٱلضُّحَىٰ", revelation: "مكية", ayahs: 11 },
  { number: 94, name: "ٱلشَّرْحُ", revelation: "مكية", ayahs: 8 },
  { number: 95, name: "ٱلتِّينِ", revelation: "مكية", ayahs: 8 },
  { number: 96, name: "ٱلْعَلَقُ", revelation: "مكية", ayahs: 19 },
  { number: 97, name: "ٱلْقَدْرُ", revelation: "مكية", ayahs: 5 },
  { number: 98, name: "ٱلْبَيِّنَةُ", revelation: "مدنية", ayahs: 8 },
  { number: 99, name: "ٱلزَّلْزَلَةُ", revelation: "مدنية", ayahs: 8 },
  { number: 100, name: "ٱلْعَادِيَاتُ", revelation: "مكية", ayahs: 11 },
  { number: 101, name: "ٱلْقَارِعَةُ", revelation: "مكية", ayahs: 11 },
  { number: 102, name: "ٱلتَّكَاثُرُ", revelation: "مكية", ayahs: 8 },
  { number: 103, name: "ٱلْعَصْرِ", revelation: "مكية", ayahs: 3 },
  { number: 104, name: "ٱلْهُمَزَةُ", revelation: "مكية", ayahs: 9 },
  { number: 105, name: "ٱلْفِيلُ", revelation: "مكية", ayahs: 5 },
  { number: 106, name: "قُرَيْشٍ", revelation: "مكية", ayahs: 4 },
  { number: 107, name: "ٱلْمَاعُونَ", revelation: "مكية", ayahs: 7 },
  { number: 108, name: "ٱلْكَوْثَرُ", revelation: "مكية", ayahs: 3 },
  { number: 109, name: "ٱلْكَافِرُونَ", revelation: "مكية", ayahs: 6 },
  { number: 110, name: "ٱلنَّصْرُ", revelation: "مدنية", ayahs: 3 },
  { number: 111, name: "ٱلْمَسَدُ", revelation: "مكية", ayahs: 5 },
  { number: 112, name: "ٱلْإِخْلَاصُ", revelation: "مكية", ayahs: 4 },
  { number: 113, name: "ٱلْفَلَقِ", revelation: "مكية", ayahs: 5 },
  { number: 114, name: "ٱلنَّاسِ", revelation: "مكية", ayahs: 6 },
];

export const QuranJuz = [
  {
    number: 1,
    surahs: ["الفاتحة", "البقرة"],
  },
  {
    number: 2,
    surahs: ["البقرة"],
  },
  {
    number: 3,
    surahs: ["البقرة", "آل عمران"],
  },
  {
    number: 4,
    surahs: ["آل عمران", "النساء"],
  },
  {
    number: 5,
    surahs: ["النساء"],
  },
  {
    number: 6,
    surahs: ["المائدة", "الأنعام"],
  },
  {
    number: 7,
    surahs: ["الأنعام", "الأعراف"],
  },
  {
    number: 8,
    surahs: ["الأعراف", "الأنفال"],
  },
  {
    number: 9,
    surahs: ["الأنفال", "التوبة"],
  },
  {
    number: 10,
    surahs: ["التوبة", "يونس", "هود"],
  },
  {
    number: 11,
    surahs: ["هود", "يوسف"],
  },
  {
    number: 12,
    surahs: ["يوسف", "الرعد", "إبراهيم"],
  },
  {
    number: 13,
    surahs: ["الحجر", "النحل"],
  },
  {
    number: 14,
    surahs: ["الإسراء", "الكهف", "مريم", "طه", "الأنبياء"],
  },
  {
    number: 15,
    surahs: ["الأنبياء", "الحج"],
  },
  {
    number: 16,
    surahs: ["الفرقان", "الشعراء", "النمل"],
  },
  {
    number: 17,
    surahs: ["القصص", "العنكبوت", "الروم"],
  },
  {
    number: 18,
    surahs: ["لقمان", "السجدة", "الأحزاب"],
  },
  {
    number: 19,
    surahs: ["سبأ", "فاطر", "يس"],
  },
  {
    number: 20,
    surahs: ["الصافات", "ص", "الزمر"],
  },
  {
    number: 21,
    surahs: ["غافر", "فصلت"],
  },
  {
    number: 22,
    surahs: ["الشورى", "الزخرف", "الدخان", "الجاثية"],
  },
  {
    number: 23,
    surahs: ["الأحقاف", "الذاريات"],
  },
  {
    number: 24,
    surahs: ["الذاريات", "الحديد"],
  },
  {
    number: 25,
    surahs: ["المجادلة", "التحريم"],
  },
  {
    number: 26,
    surahs: ["الملك", "المرسلات"],
  },
  {
    number: 27,
    surahs: ["النبأ", "الناس"],
  },
  {
    number: 28,
    surahs: ["المجادلة", "التحريم"],
  },
  {
    number: 29,
    surahs: ["الملك", "المرسلات"],
  },
  {
    number: 30,
    surahs: [
      "النبأ",
      "النازعات",
      "عبس",
      "التكوير",
      "الإنفطار",
      "المطففين",
      "الإنشقاق",
      "البروج",
      "الطارق",
      "الأعلى",
      "الغاشية",
      "الفجر",
      "البلد",
      "الشمس",
      "الليل",
      "الضحى",
      "الشرح",
      "التين",
      "العلق",
      "القدر",
      "البينة",
      "الزلزلة",
      "العاديات",
      "القارعة",
      "التكاثر",
      "العصر",
      "الهمزة",
      "الفيل",
      "قريش",
      "الماعون",
      "الكوثر",
      "الكافرون",
      "النصر",
      "المسد",
      "الإخلاص",
      "الفلق",
      "الناس",
    ],
  },
];

export const ayahOptions = [
  {
    label: "حفظ",
    icon: React.createElement(CiBookmark),
  },
  {
    label: "نسخ",
    icon: React.createElement(MdOutlineContentCopy),
  },
  {
    label: "تفسير",
    icon: React.createElement(FiBookOpen),
  },
  {
    label: "استماع",
    icon: React.createElement(SlControlPlay),
  },
];

export const quranRiwayat = [
  {
    id: 1,
    name: "حفص عن عاصم",
  },
  {
    id: 2,
    name: "ورش عن نافع",
  },
  {
    id: 3,
    name: "خلف عن حمزة",
  },
  {
    id: 4,
    name: "البزي عن ابن كثير",
  },
  {
    id: 5,
    name: "قالون عن نافع",
  },
  {
    id: 6,
    name: "قنبل عن ابن كثير",
  },
  {
    id: 7,
    name: "السوسي عن أبي عمرو",
  },
  {
    id: 8,
    name: "قالون عن نافع من طريق أبي نشيط",
  },
  {
    id: 9,
    name: "قراءة يعقوب الحضرمي بروايتي رويس وروح",
  },
  {
    id: 10,
    name: "ورش عن نافع من طريق أبي بكر الأصبهاني",
  },
  {
    id: 11,
    name: "البزي وقنبل عن ابن كثير",
  },
  {
    id: 12,
    name: "الدوري عن الكسائي",
  },
  {
    id: 13,
    name: "الدوري عن أبي عمرو",
  },
  {
    id: 15,
    name: "شعبة  عن عاصم",
  },
  {
    id: 16,
    name: "ابن ذكوان عن ابن عامر",
  },
  {
    id: 18,
    name: "ورش عن نافع من طريق الأزرق",
  },
  {
    id: 19,
    name: "هشام عن ابي عامر",
  },
  {
    id: 20,
    name: "ابن جماز عن أبي جعفر",
  },
  {
    id: 21,
    name: "المصحف المعلم",
  },
  {
    id: 22,
    name: "المصحف المجود",
  },
];

export const reciters = [
  {
    id: 1,
    name: "إبراهيم الأخضر",
    letter: "إ",
    moshaf: [
      {
        id: 1,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/akdr/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 10,
    name: "أكرم العلاقمي",
    letter: "أ",
    moshaf: [
      {
        id: 10,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/akrm/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 100,
    name: "ماجد العنزي",
    letter: "م",
    moshaf: [
      {
        id: 100,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/majd_onazi/",
        surah_total: 113,
        moshaf_type: 11,
        surah_list:
          "1,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 102,
    name: "ماهر المعيقلي",
    letter: "م",
    moshaf: [
      {
        id: 133,
        name: "المصحف المجود - المصحف المجود",
        server: "https://server12.mp3quran.net/maher/Almusshaf-Al-Mojawwad/",
        surah_total: 114,
        moshaf_type: 222,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 103,
        name: "المصحف المعلم - المصحف المعلم",
        server: "https://server12.mp3quran.net/maher/Almusshaf-Al-Mo-lim/",
        surah_total: 38,
        moshaf_type: 213,
        surah_list:
          "1,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 102,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/maher/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 104,
    name: "محمد الأيراوي",
    letter: "م",
    moshaf: [
      {
        id: 104,
        name: "ورش عن نافع من طريق الأزرق - مرتل",
        server: "https://server6.mp3quran.net/earawi/",
        surah_total: 112,
        moshaf_type: 181,
        surah_list:
          "1,2,3,4,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 105,
    name: "محمد البراك",
    letter: "م",
    moshaf: [
      {
        id: 105,
        name: "حفص عن عاصم - مرتل",
        server: "https://server13.mp3quran.net/braak/",
        surah_total: 63,
        moshaf_type: 11,
        surah_list:
          "1,12,14,36,37,44,45,50,51,52,53,54,55,56,57,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 106,
    name: "محمد الطبلاوي",
    letter: "م",
    moshaf: [
      {
        id: 106,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/tblawi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 107,
    name: "محمد اللحيدان",
    letter: "م",
    moshaf: [
      {
        id: 107,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/lhdan/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 108,
    name: "محمد المحيسني",
    letter: "م",
    moshaf: [
      {
        id: 108,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/mhsny/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 109,
    name: "محمد أيوب",
    letter: "م",
    moshaf: [
      {
        id: 320,
        name: "حفص عن عاصم - 4",
        server: "https://server16.mp3quran.net/ayyoub2/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 14,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 109,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/ayyub/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 11,
    name: "الحسيني العزازي",
    letter: "ا",
    moshaf: [
      {
        id: 11,
        name: "المصحف المعلم - المصحف المعلم",
        server: "https://server8.mp3quran.net/3zazi/",
        surah_total: 57,
        moshaf_type: 213,
        surah_list:
          "58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 110,
    name: "محمد صالح عالم شاه",
    letter: "م",
    moshaf: [
      {
        id: 110,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/shah/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 111,
    name: "محمد جبريل",
    letter: "م",
    moshaf: [
      {
        id: 111,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/jbrl/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 112,
    name: "محمد صديق المنشاوي",
    letter: "م",
    moshaf: [
      {
        id: 114,
        name: "المصحف المعلم - المصحف المعلم",
        server: "https://server10.mp3quran.net/minsh/Almusshaf-Al-Mo-lim/",
        surah_total: 114,
        moshaf_type: 213,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 113,
        name: "المصحف المجود - المصحف المجود",
        server: "https://server10.mp3quran.net/minsh/Almusshaf-Al-Mojawwad/",
        surah_total: 114,
        moshaf_type: 222,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 112,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/minsh/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 115,
    name: "محمد عبدالكريم",
    letter: "م",
    moshaf: [
      {
        id: 210,
        name: "ورش عن نافع من طريق أبي بكر الأصبهاني - مرتل",
        server:
          "https://server12.mp3quran.net/m_krm/Rewayat-Warsh-A-n-Nafi-Men-Tariq-Abi-Baker-Alasbahani/",
        surah_total: 114,
        moshaf_type: 101,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 115,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/m_krm/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 116,
    name: "محمد عبدالحكيم سعيد العبدالله",
    letter: "م",
    moshaf: [
      {
        id: 117,
        name: "الدوري عن الكسائي - مرتل",
        server:
          "https://server9.mp3quran.net/abdullah/Rewayat-AlDorai-A-n-Al-Kisa-ai/",
        surah_total: 114,
        moshaf_type: 121,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 116,
        name: "البزي وقنبل عن ابن كثير - مرتل",
        server: "https://server9.mp3quran.net/abdullah/",
        surah_total: 114,
        moshaf_type: 111,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 118,
    name: "محمود خليل الحصري",
    letter: "م",
    moshaf: [
      {
        id: 270,
        name: "قالون عن نافع - مرتل",
        server: "https://server13.mp3quran.net/husr/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 269,
        name: "الدوري عن أبي عمرو - مرتل",
        server:
          "https://server13.mp3quran.net/husr/Rewayat-Aldori-A-n-Abi-Amr/",
        surah_total: 114,
        moshaf_type: 131,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 120,
        name: "ورش عن نافع - مرتل",
        server: "https://server13.mp3quran.net/husr/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 119,
        name: "المصحف المجود - المصحف المجود",
        server: "https://server13.mp3quran.net/husr/Almusshaf-Al-Mojawwad/",
        surah_total: 114,
        moshaf_type: 222,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 118,
        name: "حفص عن عاصم - مرتل",
        server: "https://server13.mp3quran.net/husr/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 12,
    name: "إدريس أبكر",
    letter: "إ",
    moshaf: [
      {
        id: 12,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/abkr/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 121,
    name: "محمود علي البنا",
    letter: "م",
    moshaf: [
      {
        id: 122,
        name: "المصحف المجود - المصحف المجود",
        server: "https://server8.mp3quran.net/bna/Almusshaf-Al-Mojawwad/",
        surah_total: 114,
        moshaf_type: 222,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 121,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/bna/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 123,
    name: "مشاري العفاسي",
    letter: "م",
    moshaf: [
      {
        id: 124,
        name: "الدوري عن الكسائي - مرتل",
        server:
          "https://server8.mp3quran.net/afs/Rewayat-AlDorai-A-n-Al-Kisa-ai/",
        surah_total: 6,
        moshaf_type: 121,
        surah_list: "12,14,25,87,97,99",
      },
      {
        id: 123,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/afs/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 125,
    name: "مصطفى إسماعيل",
    letter: "م",
    moshaf: [
      {
        id: 288,
        name: "المصحف المجود - المصحف المجود",
        server: "https://server8.mp3quran.net/mustafa/Almusshaf-Al-Mojawwad/",
        surah_total: 114,
        moshaf_type: 222,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 125,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/mustafa/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 126,
    name: "مصطفى اللاهوني",
    letter: "م",
    moshaf: [
      {
        id: 126,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/lahoni/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 127,
    name: "مصطفى رعد العزاوي",
    letter: "م",
    moshaf: [
      {
        id: 127,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/ra3ad/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 128,
    name: "معمر الأندونيسي",
    letter: "م",
    moshaf: [
      {
        id: 128,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/muamr/",
        surah_total: 8,
        moshaf_type: 11,
        surah_list: "36,93,94,97,101,109,110,111",
      },
    ],
  },
  {
    id: 129,
    name: "مفتاح السلطني",
    letter: "م",
    moshaf: [
      {
        id: 196,
        name: "ابن ذكوان عن ابن عامر - مرتل",
        server:
          "https://server14.mp3quran.net/muftah_sultany/Rewayat_Ibn-Thakwan-A-n-Ibn-Amer/",
        surah_total: 114,
        moshaf_type: 161,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 195,
        name: "شعبة  عن عاصم - مرتل",
        server:
          "https://server14.mp3quran.net/muftah_sultany/Rewayat_Sho-bah-A-n-Asim/",
        surah_total: 77,
        moshaf_type: 151,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77",
      },
      {
        id: 182,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server14.mp3quran.net/muftah_sultany/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 180,
        name: "الدوري عن الكسائي - مرتل",
        server:
          "https://server14.mp3quran.net/muftah_sultany/Rewayat-AlDorai-A-n-Al-Kisa-ai/",
        surah_total: 114,
        moshaf_type: 121,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 129,
        name: "الدوري عن أبي عمرو - مرتل",
        server:
          "https://server14.mp3quran.net/muftah_sultany/Rewayat-Aldori-A-n-Abi-Amr/",
        surah_total: 114,
        moshaf_type: 131,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 13,
    name: "الزين محمد أحمد",
    letter: "ا",
    moshaf: [
      {
        id: 13,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/alzain/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 134,
    name: "محمد سايد",
    letter: "م",
    moshaf: [
      {
        id: 134,
        name: "ورش عن نافع - مرتل",
        server: "https://server16.mp3quran.net/m_sayed/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 135,
    name: "عبدالرحمن السويّد",
    letter: "ع",
    moshaf: [
      {
        id: 135,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_swaiyd/Rewayat-Hafs-A-n-Assem/",
        surah_total: 107,
        moshaf_type: 11,
        surah_list:
          "2,8,9,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 136,
    name: "عبدالإله بن عون",
    letter: "ع",
    moshaf: [
      {
        id: 136,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_binaoun/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 137,
    name: "أحمد طالب بن حميد",
    letter: "أ",
    moshaf: [
      {
        id: 137,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_binhameed/Rewayat-Hafs-A-n-Assem/",
        surah_total: 107,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,10,11,12,13,15,18,19,20,21,22,25,26,27,28,29,30,31,32,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 138,
    name: "نورين محمد صديق",
    letter: "ن",
    moshaf: [
      {
        id: 138,
        name: "الدوري عن أبي عمرو - مرتل",
        server:
          "https://server16.mp3quran.net/nourin_siddig/Rewayat-Aldori-A-n-Abi-Amr/",
        surah_total: 114,
        moshaf_type: 131,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 139,
    name: "ماجد الزامل",
    letter: "م",
    moshaf: [
      {
        id: 139,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/zaml/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 14,
    name: "القارئ ياسين",
    letter: "ا",
    moshaf: [
      {
        id: 14,
        name: "ورش عن نافع - مرتل",
        server: "https://server11.mp3quran.net/qari/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 149,
    name: "ماهر شخاشيرو",
    letter: "م",
    moshaf: [
      {
        id: 149,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/shaksh/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 15,
    name: "العشري عمران",
    letter: "ا",
    moshaf: [
      {
        id: 15,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/omran/",
        surah_total: 113,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 150,
    name: "محمد المنشد",
    letter: "م",
    moshaf: [
      {
        id: 150,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/monshed/",
        surah_total: 110,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,80,81,82,83,84,85,86,87,88,90,91,92,93,94,95,96,97,98,99,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 151,
    name: "محمود الشيمي",
    letter: "م",
    moshaf: [
      {
        id: 151,
        name: "الدوري عن الكسائي - مرتل",
        server: "https://server10.mp3quran.net/sheimy/",
        surah_total: 114,
        moshaf_type: 121,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 152,
    name: "ياسر سلامة",
    letter: "ي",
    moshaf: [
      {
        id: 152,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/salamah/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 153,
    name: "أخيل عبدالحي روا",
    letter: "أ",
    moshaf: [
      {
        id: 153,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/akil/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "50,51,52,56",
      },
    ],
  },
  {
    id: 154,
    name: "أستاذ زامري",
    letter: "أ",
    moshaf: [
      {
        id: 154,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/zamri/",
        surah_total: 7,
        moshaf_type: 11,
        surah_list: "32,44,55,56,61,67,76",
      },
    ],
  },
  {
    id: 159,
    name: "خالد المهنا",
    letter: "خ",
    moshaf: [
      {
        id: 159,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/mohna/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 16,
    name: "العيون الكوشي",
    letter: "ا",
    moshaf: [
      {
        id: 16,
        name: "ورش عن نافع - مرتل",
        server: "https://server11.mp3quran.net/koshi/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 160,
    name: "عادل الكلباني",
    letter: "ع",
    moshaf: [
      {
        id: 160,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/a_klb/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 161,
    name: "موسى بلال",
    letter: "م",
    moshaf: [
      {
        id: 161,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/bilal/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 162,
    name: "حسين آل الشيخ",
    letter: "ح",
    moshaf: [
      {
        id: 162,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/alshaik/",
        surah_total: 59,
        moshaf_type: 11,
        surah_list:
          "2,8,13,14,22,32,36,38,44,45,49,50,54,55,56,57,62,63,64,65,66,72,73,75,76,77,78,79,80,81,82,85,87,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 163,
    name: "حاتم فريد الواعر",
    letter: "ح",
    moshaf: [
      {
        id: 163,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/hatem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 164,
    name: "إبراهيم الجرمي",
    letter: "إ",
    moshaf: [
      {
        id: 164,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/jormy/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 165,
    name: "محمود الرفاعي",
    letter: "م",
    moshaf: [
      {
        id: 165,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/mrifai/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 166,
    name: "ناصر العبيد",
    letter: "ن",
    moshaf: [
      {
        id: 166,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/obaid/",
        surah_total: 67,
        moshaf_type: 11,
        surah_list:
          "3,7,10,13,14,15,19,21,25,26,27,32,35,36,37,38,39,40,41,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 167,
    name: "واصل المذن",
    letter: "و",
    moshaf: [
      {
        id: 167,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/wasel/Rewayat-Hafs-A-n-Assem/",
        surah_total: 9,
        moshaf_type: 11,
        surah_list: "8,9,36,38,42,45,50,59,60",
      },
    ],
  },
  {
    id: 17,
    name: "توفيق الصايغ",
    letter: "ت",
    moshaf: [
      {
        id: 17,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/twfeeq/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 178,
    name: "إبراهيم الدوسري",
    letter: "إ",
    moshaf: [
      {
        id: 232,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server10.mp3quran.net/ibrahim_dosri/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 178,
        name: "ورش عن نافع - مرتل",
        server:
          "https://server10.mp3quran.net/ibrahim_dosri/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 18,
    name: "جمال شاكر عبدالله",
    letter: "ج",
    moshaf: [
      {
        id: 18,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/jamal/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 181,
    name: "جمعان العصيمي",
    letter: "ج",
    moshaf: [
      {
        id: 181,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/jaman/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 183,
    name: "رضية عبدالرحمن",
    letter: "ر",
    moshaf: [
      {
        id: 183,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/rziah/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "3,8,33,35",
      },
    ],
  },
  {
    id: 184,
    name: "رقية سولونق",
    letter: "ر",
    moshaf: [
      {
        id: 184,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/rogiah/",
        surah_total: 1,
        moshaf_type: 11,
        surah_list: "36",
      },
    ],
  },
  {
    id: 185,
    name: "سابينة مامات",
    letter: "س",
    moshaf: [
      {
        id: 185,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/mamat/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "3,14,21,22",
      },
    ],
  },
  {
    id: 187,
    name: "سيدين عبدالرحمن",
    letter: "س",
    moshaf: [
      {
        id: 187,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/sideen/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "17,23,56,75",
      },
    ],
  },
  {
    id: 188,
    name: "عبدالغني عبدالله",
    letter: "ع",
    moshaf: [
      {
        id: 188,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/abdulgani/",
        surah_total: 13,
        moshaf_type: 11,
        surah_list: "1,2,5,6,9,67,87,91,92,94,95,97,114",
      },
    ],
  },
  {
    id: 189,
    name: "عبدالله فهمي",
    letter: "ع",
    moshaf: [
      {
        id: 189,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/fhmi/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "1,36,53,75",
      },
    ],
  },
  {
    id: 19,
    name: "حمد الدغريري",
    letter: "ح",
    moshaf: [
      {
        id: 19,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/hamad/",
        surah_total: 87,
        moshaf_type: 11,
        surah_list:
          "1,2,12,13,19,21,27,29,31,36,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 190,
    name: "محمد الحافظ",
    letter: "م",
    moshaf: [
      {
        id: 190,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/hafz/",
        surah_total: 3,
        moshaf_type: 11,
        surah_list: "1,19,31",
      },
    ],
  },
  {
    id: 191,
    name: "محمد حفص علي",
    letter: "م",
    moshaf: [
      {
        id: 191,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/hfs/",
        surah_total: 5,
        moshaf_type: 11,
        surah_list: "1,9,11,13,67",
      },
    ],
  },
  {
    id: 192,
    name: "محمد خير النور",
    letter: "م",
    moshaf: [
      {
        id: 192,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/malaysia/nor/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "1,12,19,31",
      },
    ],
  },
  {
    id: 193,
    name: "يوسف بن نوح أحمد",
    letter: "ي",
    moshaf: [
      {
        id: 193,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/noah/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 194,
    name: "جمال الدين الزيلعي",
    letter: "ج",
    moshaf: [
      {
        id: 194,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/zilaie/",
        surah_total: 8,
        moshaf_type: 11,
        surah_list: "1,19,32,54,67,70,73,91",
      },
    ],
  },
  {
    id: 197,
    name: "معيض الحارثي",
    letter: "م",
    moshaf: [
      {
        id: 197,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/harthi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 198,
    name: "محمد رشاد الشريف",
    letter: "م",
    moshaf: [
      {
        id: 198,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/rashad/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 2,
    name: "إبراهيم الجبرين",
    letter: "إ",
    moshaf: [
      {
        id: 2,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/jbreen/",
        surah_total: 107,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,6,7,8,10,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,30,31,32,33,34,35,36,37,38,39,40,41,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 20,
    name: "خالد الجليل",
    letter: "خ",
    moshaf: [
      {
        id: 20,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/jleel/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 201,
    name: "أحمد الطرابلسي",
    letter: "أ",
    moshaf: [
      {
        id: 201,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/trabulsi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 199,
        name: "قالون عن نافع - مرتل",
        server: "https://server10.mp3quran.net/trablsi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 202,
    name: "عبدالله الكندري",
    letter: "ع",
    moshaf: [
      {
        id: 202,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/Abdullahk/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 203,
    name: "أحمد عامر",
    letter: "أ",
    moshaf: [
      {
        id: 203,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/Aamer/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 204,
    name: "إبراهيم السعدان",
    letter: "إ",
    moshaf: [
      {
        id: 204,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/IbrahemSadan/",
        surah_total: 50,
        moshaf_type: 11,
        surah_list:
          "1,4,5,6,7,8,9,11,12,15,16,19,20,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 205,
    name: "أحمد الحذيفي",
    letter: "أ",
    moshaf: [
      {
        id: 205,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/ahmad_huth/",
        surah_total: 110,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,34,35,36,38,39,41,42,43,44,45,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 206,
    name: "محمد عثمان خان",
    letter: "م",
    moshaf: [
      {
        id: 206,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/khan/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 207,
    name: "يوسف الدغوش",
    letter: "ي",
    moshaf: [
      {
        id: 207,
        name: "حفص عن عاصم - مرتل",
        server: "https://server7.mp3quran.net/dgsh/",
        surah_total: 26,
        moshaf_type: 11,
        surah_list:
          "1,3,55,67,71,73,75,78,82,85,87,88,90,91,92,100,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 208,
    name: "الدوكالي محمد العالم",
    letter: "ا",
    moshaf: [
      {
        id: 208,
        name: "قالون عن نافع - مرتل",
        server: "https://server7.mp3quran.net/dokali/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 209,
    name: "وشيار حيدر اربيلي",
    letter: "و",
    moshaf: [
      {
        id: 209,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/wishear/",
        surah_total: 2,
        moshaf_type: 11,
        surah_list: "55,56",
      },
    ],
  },
  {
    id: 21,
    name: "خالد القحطاني",
    letter: "خ",
    moshaf: [
      {
        id: 21,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/qht/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 211,
    name: "الفاتح محمد الزبير",
    letter: "ا",
    moshaf: [
      {
        id: 211,
        name: "الدوري عن أبي عمرو - مرتل",
        server: "https://server6.mp3quran.net/fateh/",
        surah_total: 114,
        moshaf_type: 131,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21181,
    name: "محمد برهجي",
    letter: "م",
    moshaf: [
      {
        id: 340,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/M_Burhaji/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21182,
    name: "يوسف العيدروس",
    letter: "ي",
    moshaf: [
      {
        id: 10904,
        name: "حفص عن عاصم - 4",
        server:
          "https://server16.mp3quran.net/Y_ALaidroos/Rewayat-Hafs-A-n-Assem/",
        surah_total: 110,
        moshaf_type: 14,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,24,25,26,27,28,29,31,32,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21183,
    name: "حسن الدغريري",
    letter: "ح",
    moshaf: [
      {
        id: 10905,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/H-Aldaghriri/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21184,
    name: "محمد الفقيه",
    letter: "م",
    moshaf: [
      {
        id: 10906,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/M_Alfaqih/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21186,
    name: "جنيد آدم عبدالله",
    letter: "ج",
    moshaf: [
      {
        id: 10908,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/J-Abdullah/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21187,
    name: "خالد الزيادي",
    letter: "خ",
    moshaf: [
      {
        id: 10909,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/K-Alzadi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21188,
    name: "الوليد الشمسان",
    letter: "ا",
    moshaf: [
      {
        id: 10910,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/shamsan/Rewayat-Hafs-A-n-Assem/",
        surah_total: 70,
        moshaf_type: 11,
        surah_list:
          "1,17,19,20,24,25,26,29,30,31,32,33,35,36,37,41,42,43,44,45,47,48,49,50,51,52,53,54,55,56,57,58,59,60,62,63,64,65,66,67,68,70,75,76,81,82,85,86,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 21191,
    name: "إبراهيم الشهري",
    letter: "إ",
    moshaf: [
      {
        id: 10911,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/Ibrahim-Al-Shahri/Rewayat-Hafs-A-n-Assem/",
        surah_total: 76,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77",
      },
    ],
  },
  {
    id: 212,
    name: "طارق عبدالغني دعوب",
    letter: "ط",
    moshaf: [
      {
        id: 212,
        name: "قالون عن نافع - مرتل",
        server: "https://server10.mp3quran.net/tareq/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 216,
    name: "عثمان الأنصاري",
    letter: "ع",
    moshaf: [
      {
        id: 216,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/Othmn/",
        surah_total: 76,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,40,41,42,43,44,46,47,48,49,50,51,52,53,54,55,56,58,59,60,61,62,63,64,65,66,67,68,69,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 217,
    name: "بندر بليله",
    letter: "ب",
    moshaf: [
      {
        id: 217,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/balilah/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 218,
    name: "خالد الشريمي",
    letter: "خ",
    moshaf: [
      {
        id: 218,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/shoraimy/",
        surah_total: 73,
        moshaf_type: 11,
        surah_list:
          "1,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 219,
    name: "وديع اليمني",
    letter: "و",
    moshaf: [
      {
        id: 219,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/wdee3/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 22,
    name: "خالد عبدالكافي",
    letter: "خ",
    moshaf: [
      {
        id: 22,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/kafi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 221,
    name: "رعد محمد الكردي",
    letter: "ر",
    moshaf: [
      {
        id: 221,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/kurdi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 225,
    name: "عبدالرحمن العوسي",
    letter: "ع",
    moshaf: [
      {
        id: 225,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/aloosi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 226,
    name: "خالد الغامدي",
    letter: "خ",
    moshaf: [
      {
        id: 226,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/ghamdi/",
        surah_total: 102,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,39,40,41,42,43,45,46,47,49,50,51,52,53,54,55,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,73,75,76,77,80,82,83,85,86,87,88,89,90,91,92,93,94,95,97,98,99,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 227,
    name: "رمضان شكور",
    letter: "ر",
    moshaf: [
      {
        id: 227,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/shakoor/",
        surah_total: 65,
        moshaf_type: 11,
        surah_list:
          "1,2,3,9,10,12,13,14,23,24,26,29,35,36,39,40,42,43,47,48,49,50,51,57,58,59,60,63,68,69,70,71,72,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,111,112,113,114",
      },
    ],
  },
  {
    id: 228,
    name: "عبدالمجيد الأركاني",
    letter: "ع",
    moshaf: [
      {
        id: 228,
        name: "حفص عن عاصم - مرتل",
        server: "https://server7.mp3quran.net/m_arkani/",
        surah_total: 49,
        moshaf_type: 11,
        surah_list:
          "1,12,14,15,18,19,21,22,40,50,56,76,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 229,
    name: "محمد خليل القارئ",
    letter: "م",
    moshaf: [
      {
        id: 229,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/m_qari/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 23,
    name: "خالد الوهيبي",
    letter: "خ",
    moshaf: [
      {
        id: 23,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/whabi/",
        surah_total: 25,
        moshaf_type: 11,
        surah_list:
          "1,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,24,25,29,30,31,32",
      },
    ],
  },
  {
    id: 230,
    name: "رامي الدعيس",
    letter: "ر",
    moshaf: [
      {
        id: 230,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/rami/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 231,
    name: "هزاع البلوشي",
    letter: "ه",
    moshaf: [
      {
        id: 231,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/hazza/",
        surah_total: 83,
        moshaf_type: 11,
        surah_list:
          "1,6,13,14,15,18,19,20,25,29,30,31,32,34,35,36,37,38,39,40,41,42,44,47,49,50,51,52,53,54,55,56,57,61,63,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 236,
    name: "عبدالرحمن الماجد",
    letter: "ع",
    moshaf: [
      {
        id: 236,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/a_majed/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 237,
    name: "مروان العكري",
    letter: "م",
    moshaf: [
      {
        id: 287,
        name: "قالون عن نافع - مرتل",
        server: "https://server16.mp3quran.net/m_akri/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 24,
    name: "خليفة الطنيجي",
    letter: "خ",
    moshaf: [
      {
        id: 24,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/tnjy/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 240,
    name: "سلمان العتيبي",
    letter: "س",
    moshaf: [
      {
        id: 240,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/salman/",
        surah_total: 76,
        moshaf_type: 11,
        surah_list:
          "1,2,3,10,11,14,16,19,23,25,32,36,38,39,40,46,48,50,52,55,56,58,59,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 241,
    name: "محمد رفعت",
    letter: "م",
    moshaf: [
      {
        id: 241,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/refat/",
        surah_total: 31,
        moshaf_type: 11,
        surah_list:
          "1,10,11,12,17,18,19,20,48,54,55,56,69,72,73,75,76,77,78,79,81,82,83,85,86,87,88,89,96,98,100",
      },
    ],
  },
  {
    id: 243,
    name: "عبدالله الموسى",
    letter: "ع",
    moshaf: [
      {
        id: 286,
        name: "المصحف المعلم - المصحف المعلم",
        server: "https://server14.mp3quran.net/mousa/Almusshaf-Al-Mo-lim/",
        surah_total: 38,
        moshaf_type: 213,
        surah_list:
          "1,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 243,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/mousa/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 244,
    name: "عبدالله الخلف",
    letter: "ع",
    moshaf: [
      {
        id: 244,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/khalf/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 245,
    name: "منصور السالمي",
    letter: "م",
    moshaf: [
      {
        id: 245,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/mansor/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 246,
    name: "صلاح مصلي",
    letter: "ص",
    moshaf: [
      {
        id: 246,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/musali/",
        surah_total: 49,
        moshaf_type: 11,
        surah_list:
          "50,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 247,
    name: "خالد الشارخ",
    letter: "خ",
    moshaf: [
      {
        id: 247,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/sharekh/",
        surah_total: 64,
        moshaf_type: 11,
        surah_list:
          "2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 248,
    name: "ناصر العصفور",
    letter: "ن",
    moshaf: [
      {
        id: 248,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/alosfor/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 25,
    name: "داود حمزة",
    letter: "د",
    moshaf: [
      {
        id: 25,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/hamza/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 250,
    name: "محمد البخيت",
    letter: "م",
    moshaf: [
      {
        id: 250,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/bukheet/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 251,
    name: "ناصر الماجد",
    letter: "ن",
    moshaf: [
      {
        id: 251,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/nasser_almajed/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 252,
    name: "أحمد السويلم",
    letter: "أ",
    moshaf: [
      {
        id: 252,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/swlim/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 253,
    name: "إسلام صبحي",
    letter: "إ",
    moshaf: [
      {
        id: 253,
        name: "حفص عن عاصم - مرتل",
        server: "https://server14.mp3quran.net/islam/Rewayat-Hafs-A-n-Assem/",
        surah_total: 106,
        moshaf_type: 11,
        surah_list:
          "1,2,3,5,6,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,38,41,42,43,44,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 254,
    name: "بدر التركي",
    letter: "ب",
    moshaf: [
      {
        id: 254,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/bader/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 255,
    name: "هيثم الجدعاني",
    letter: "ه",
    moshaf: [
      {
        id: 255,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/hitham/Rewayat-Hafs-A-n-Assem/",
        surah_total: 101,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,6,7,8,9,10,11,12,13,14,15,16,17,19,20,21,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,61,62,63,64,67,68,69,70,72,75,76,77,78,79,80,81,82,83,84,85,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 256,
    name: "أحمد خليل شاهين",
    letter: "أ",
    moshaf: [
      {
        id: 256,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/shaheen/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 257,
    name: "سعد المقرن",
    letter: "س",
    moshaf: [
      {
        id: 257,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/saad/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 259,
    name: "أحمد النفيس",
    letter: "أ",
    moshaf: [
      {
        id: 259,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/nufais/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 26,
    name: "رشيد إفراد",
    letter: "ر",
    moshaf: [
      {
        id: 26,
        name: "ورش عن نافع - مرتل",
        server: "https://server12.mp3quran.net/ifrad/",
        surah_total: 51,
        moshaf_type: 21,
        surah_list:
          "1,2,3,12,13,14,18,20,22,23,25,26,27,28,29,30,31,33,34,35,36,37,38,39,40,41,42,43,46,47,48,49,51,67,68,69,70,71,74,75,79,82,86,87,88,89,93,94,104,109,112",
      },
    ],
  },
  {
    id: 260,
    name: "عمر الدريويز",
    letter: "ع",
    moshaf: [
      {
        id: 260,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/darweez/Rewayat-Hafs-A-n-Assem/",
        surah_total: 89,
        moshaf_type: 11,
        surah_list:
          "1,6,8,10,12,13,14,15,16,17,18,19,20,21,22,25,27,31,32,33,35,36,37,38,39,40,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,61,62,63,64,66,67,68,69,70,71,72,73,74,75,76,78,79,80,81,82,83,85,89,90,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 263,
    name: "عبدالعزيز العسيري",
    letter: "ع",
    moshaf: [
      {
        id: 263,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/abdulazizasiri/Rewayat-Hafs-A-n-Assem/",
        surah_total: 72,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,30,31,32,35,36,37,39,40,41,45,49,50,51,52,53,54,55,56,57,63,66,67,69,70,71,72,73,75,76,77,78,80,81,83,86,87,88,89,93,99,101,107,110,112",
      },
    ],
  },
  {
    id: 264,
    name: "يونس اسويلص",
    letter: "ي",
    moshaf: [
      {
        id: 264,
        name: "ورش عن نافع - مرتل",
        server:
          "https://server16.mp3quran.net/souilass/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 65,
        moshaf_type: 21,
        surah_list:
          "1,2,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,45,46,47,48,50,51,52,53,54,56,57,67,71,73,76,77,78,79,80,81,82,86,89,90,91,93,95,97,112",
      },
    ],
  },
  {
    id: 265,
    name: "أحمد ديبان",
    letter: "أ",
    moshaf: [
      {
        id: 313,
        name: "ابن جماز عن أبي جعفر - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Ibn-Jammaz-A-n-Abi-Ja-far/",
        surah_total: 11,
        moshaf_type: 201,
        surah_list: "1,93,100,102,103,109,110,111,112,113,114",
      },
      {
        id: 312,
        name: "هشام عن ابي عامر - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Hesham-A-n-Abi-A-mer/",
        surah_total: 27,
        moshaf_type: 191,
        surah_list:
          "1,2,3,4,5,6,7,8,9,13,85,90,92,93,94,95,99,100,101,103,105,107,108,110,112,113,114",
      },
      {
        id: 311,
        name: "خلف عن حمزة - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Khalaf-A-n-Hamzah/",
        surah_total: 6,
        moshaf_type: 31,
        surah_list: "94,97,101,107,108,109",
      },
      {
        id: 310,
        name: "الدوري عن الكسائي - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-AlDorai-A-n-Al-Kisa-ai/",
        surah_total: 13,
        moshaf_type: 121,
        surah_list: "1,94,95,100,103,105,106,108,109,110,112,113,114",
      },
      {
        id: 309,
        name: "السوسي عن أبي عمرو - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Assosi-A-n-Abi-Amr/",
        surah_total: 19,
        moshaf_type: 71,
        surah_list:
          "1,82,86,87,88,93,94,95,99,102,103,106,108,109,110,111,112,113,114",
      },
      {
        id: 308,
        name: "ابن ذكوان عن ابن عامر - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Ibn-Thakwan-A-n-Ibn-Amer/",
        surah_total: 33,
        moshaf_type: 161,
        surah_list:
          "1,2,3,4,5,6,7,8,9,13,77,83,85,86,88,90,92,93,94,95,96,97,99,100,101,103,105,107,108,109,112,113,114",
      },
      {
        id: 301,
        name: "ورش عن نافع من طريق الأزرق - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Warsh-A-n-Nafi-Men-Tariq-Alazraq/",
        surah_total: 114,
        moshaf_type: 181,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 285,
        name: "الدوري عن أبي عمرو - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Aldori-A-n-Abi-Amr/",
        surah_total: 114,
        moshaf_type: 131,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 280,
        name: "قالون عن نافع - مرتل",
        server: "https://server16.mp3quran.net/deban/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 279,
        name: "البزي عن ابن كثير - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Albizi-A-n-Ibn-Katheer/",
        surah_total: 114,
        moshaf_type: 41,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 278,
        name: "قنبل عن ابن كثير - مرتل",
        server:
          "https://server16.mp3quran.net/deban/Rewayat-Qunbol-A-n-Ibn-Katheer/",
        surah_total: 114,
        moshaf_type: 61,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 276,
        name: "شعبة  عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/deban/Rewayat-Sho-bah-A-n-Asim/",
        surah_total: 114,
        moshaf_type: 151,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 265,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/deban/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 267,
    name: "عبدالله كامل",
    letter: "ع",
    moshaf: [
      {
        id: 267,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/kamel/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 268,
    name: "بيشه وا قادر الكردي",
    letter: "ب",
    moshaf: [
      {
        id: 268,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/peshawa/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 27,
    name: "رشيد بلعالية",
    letter: "ر",
    moshaf: [
      {
        id: 261,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/bl3/",
        surah_total: 5,
        moshaf_type: 11,
        surah_list: "46,47,48,49,50",
      },
      {
        id: 27,
        name: "ورش عن نافع - مرتل",
        server: "https://server6.mp3quran.net/bl3/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 271,
    name: "نذير المالكي",
    letter: "ن",
    moshaf: [
      {
        id: 271,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net//nathier/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 272,
    name: "عكاشة كميني",
    letter: "ع",
    moshaf: [
      {
        id: 296,
        name: "البزي عن ابن كثير - مرتل",
        server:
          "https://server16.mp3quran.net/okasha/Rewayat-Albizi-A-n-Ibn-Katheer/",
        surah_total: 114,
        moshaf_type: 41,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 272,
        name: "الدوري عن الكسائي - مرتل",
        server:
          "https://server16.mp3quran.net/okasha/Rewayat-AlDorai-A-n-Al-Kisa-ai/",
        surah_total: 38,
        moshaf_type: 121,
        surah_list:
          "17,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 273,
    name: "هيثم الدخين",
    letter: "ه",
    moshaf: [
      {
        id: 273,
        name: "حفص عن عاصم - 4",
        server:
          "https://server16.mp3quran.net/h_dukhain/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 14,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 274,
    name: "محمد أبو سنينة",
    letter: "م",
    moshaf: [
      {
        id: 274,
        name: "قالون عن نافع - مرتل",
        server: "https://server16.mp3quran.net/sneineh/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 275,
    name: "محمد الأمين قنيوة",
    letter: "م",
    moshaf: [
      {
        id: 275,
        name: "قالون عن نافع - مرتل",
        server: "https://server16.mp3quran.net/qeniwa/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 277,
    name: "محمود عبدالحكم",
    letter: "م",
    moshaf: [
      {
        id: 277,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/m_abdelhakam/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 278,
    name: "أحمد عيسى المعصراوي",
    letter: "أ",
    moshaf: [
      {
        id: 290,
        name: "قراءة يعقوب الحضرمي بروايتي رويس وروح - مرتل",
        server:
          "https://server16.mp3quran.net/a_maasaraawi/Rewayat-Rawh-A-n-Yakoob-Alhadrami/",
        surah_total: 64,
        moshaf_type: 91,
        surah_list:
          "51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 289,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_maasaraawi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 279,
    name: "إبراهيم كشيدان",
    letter: "إ",
    moshaf: [
      {
        id: 291,
        name: "قالون عن نافع - مرتل",
        server:
          "https://server16.mp3quran.net/i_kshidan/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 28,
    name: "زكريا حمامة",
    letter: "ز",
    moshaf: [
      {
        id: 28,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/zakariya/",
        surah_total: 7,
        moshaf_type: 11,
        surah_list: "32,36,44,56,67,76,85",
      },
    ],
  },
  {
    id: 280,
    name: "هاشم أبو دلال",
    letter: "ه",
    moshaf: [
      {
        id: 292,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/h_abudalal/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 281,
    name: "فؤاد الخامري",
    letter: "ف",
    moshaf: [
      {
        id: 293,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/f_khamery/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 282,
    name: "سيد أحمد هاشمي",
    letter: "س",
    moshaf: [
      {
        id: 294,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/s_hashemi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 283,
    name: "خالد كريم محمدي",
    letter: "خ",
    moshaf: [
      {
        id: 295,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/kh_mohammadi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 284,
    name: "مال الله عبدالرحمن الجابر",
    letter: "م",
    moshaf: [
      {
        id: 297,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/mal-allah_jaber/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 285,
    name: "سلمان الصديق",
    letter: "س",
    moshaf: [
      {
        id: 298,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/s_sadeiq/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 286,
    name: "حسن صالح",
    letter: "ح",
    moshaf: [
      {
        id: 299,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/h_saleh/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 287,
    name: "عبدالرحمن الشحات",
    letter: "ع",
    moshaf: [
      {
        id: 302,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_alshahhat/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 288,
    name: "عيسى عمر سناكو",
    letter: "ع",
    moshaf: [
      {
        id: 303,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/i_sanankoua/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 289,
    name: "هارون بقائي",
    letter: "ه",
    moshaf: [
      {
        id: 304,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/h_baqai/Rewayat-Hafs-A-n-Assem/",
        surah_total: 51,
        moshaf_type: 11,
        surah_list:
          "1,56,62,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 29,
    name: "عبدالله بخاري",
    letter: "ع",
    moshaf: [
      {
        id: 281,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_bukhari/Rewayat-Hafs-A-n-Assem/",
        surah_total: 80,
        moshaf_type: 11,
        surah_list:
          "1,2,36,37,38,39,40,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 290,
    name: "صالح القريشي",
    letter: "ص",
    moshaf: [
      {
        id: 306,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/s_alquraishi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 3,
    name: "إبراهيم العسيري",
    letter: "إ",
    moshaf: [
      {
        id: 3,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/3siri/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 30,
    name: "سعد الغامدي",
    letter: "س",
    moshaf: [
      {
        id: 30,
        name: "حفص عن عاصم - مرتل",
        server: "https://server7.mp3quran.net/s_gmd/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 300,
    name: "صالح الشمراني",
    letter: "ص",
    moshaf: [
      {
        id: 300,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/shamrani/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 301,
    name: "فيصل الهاجري",
    letter: "ف",
    moshaf: [
      {
        id: 307,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/f_hajry/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 302,
    name: "أنس العمادي",
    letter: "أ",
    moshaf: [
      {
        id: 314,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_alemadi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 303,
    name: "عبدالملك العسكر",
    letter: "ع",
    moshaf: [
      {
        id: 315,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_alaskar/Rewayat-Hafs-A-n-Assem/",
        surah_total: 7,
        moshaf_type: 11,
        surah_list: "30,36,40,69,70,71,75",
      },
    ],
  },
  {
    id: 304,
    name: "عبدالكريم الحازمي",
    letter: "ع",
    moshaf: [
      {
        id: 316,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a_alhazmi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 305,
    name: "هشام الهراز",
    letter: "ه",
    moshaf: [
      {
        id: 317,
        name: "ورش عن نافع - مرتل",
        server:
          "https://server16.mp3quran.net/H-Lharraz/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 113,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 306,
    name: "عبدالله المشعل",
    letter: "ع",
    moshaf: [
      {
        id: 318,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/a-almishal/Rewayat-Hafs-A-n-Assem/",
        surah_total: 11,
        moshaf_type: 11,
        surah_list: "8,14,41,49,50,51,52,53,54,55,56",
      },
    ],
  },
  {
    id: 307,
    name: "عبدالعزيز سحيم",
    letter: "ع",
    moshaf: [
      {
        id: 319,
        name: "ورش عن نافع - مرتل",
        server: "https://server16.mp3quran.net/a_sheim/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 16,
        moshaf_type: 21,
        surah_list: "1,18,19,31,49,50,51,54,55,56,66,67,72,75,87,112",
      },
    ],
  },
  {
    id: 31,
    name: "سعود الشريم",
    letter: "س",
    moshaf: [
      {
        id: 31,
        name: "حفص عن عاصم - مرتل",
        server: "https://server7.mp3quran.net/shur/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 32,
    name: "سهل ياسين",
    letter: "س",
    moshaf: [
      {
        id: 32,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/shl/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 33,
    name: "زكي داغستاني",
    letter: "ز",
    moshaf: [
      {
        id: 33,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/zaki/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 34,
    name: "سامي الحسن",
    letter: "س",
    moshaf: [
      {
        id: 34,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/sami_hsn/",
        surah_total: 28,
        moshaf_type: 11,
        surah_list:
          "1,19,20,24,26,27,32,34,50,55,81,82,86,87,88,91,92,93,94,95,97,102,104,105,109,110,111,112",
      },
    ],
  },
  {
    id: 35,
    name: "سامي الدوسري",
    letter: "س",
    moshaf: [
      {
        id: 35,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/sami_dosr/",
        surah_total: 53,
        moshaf_type: 11,
        surah_list:
          "2,8,9,12,13,14,29,30,31,32,33,34,35,39,40,41,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 36,
    name: "سيد رمضان",
    letter: "س",
    moshaf: [
      {
        id: 36,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/sayed/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 37,
    name: "شعبان الصياد",
    letter: "ش",
    moshaf: [
      {
        id: 37,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/shaban/",
        surah_total: 65,
        moshaf_type: 11,
        surah_list:
          "2,3,4,5,6,7,9,10,11,12,13,16,17,19,20,21,22,24,26,27,28,29,32,33,35,38,40,41,42,43,45,46,47,52,53,54,59,60,67,68,69,77,78,79,80,81,82,87,88,89,90,91,92,94,95,96,97,98,99,100,101,102,103,104,105",
      },
    ],
  },
  {
    id: 38,
    name: "شيرزاد عبدالرحمن طاهر",
    letter: "ش",
    moshaf: [
      {
        id: 38,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/taher/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 39,
    name: "صابر عبدالحكم",
    letter: "ص",
    moshaf: [
      {
        id: 39,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/hkm/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 4,
    name: "شيخ أبو بكر الشاطري",
    letter: "ش",
    moshaf: [
      {
        id: 4,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/shatri/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 40,
    name: "صالح الصاهود",
    letter: "ص",
    moshaf: [
      {
        id: 40,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/sahood/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 41,
    name: "صالح آل طالب",
    letter: "ص",
    moshaf: [
      {
        id: 41,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/tlb/",
        surah_total: 33,
        moshaf_type: 11,
        surah_list:
          "1,2,25,34,38,39,44,45,46,47,55,56,57,58,59,60,61,70,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86",
      },
    ],
  },
  {
    id: 42,
    name: "صالح الهبدان",
    letter: "ص",
    moshaf: [
      {
        id: 42,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/habdan/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 43,
    name: "صلاح البدير",
    letter: "ص",
    moshaf: [
      {
        id: 43,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/s_bud/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 44,
    name: "صلاح الهاشم",
    letter: "ص",
    moshaf: [
      {
        id: 45,
        name: "قالون عن نافع - مرتل",
        server:
          "https://server12.mp3quran.net/salah_hashim_m/Rewayat-Qalon-A-n-Nafi/",
        surah_total: 7,
        moshaf_type: 51,
        surah_list: "1,12,40,50,53,75,76",
      },
      {
        id: 44,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/salah_hashim_m/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 46,
    name: "صلاح بو خاطر",
    letter: "ص",
    moshaf: [
      {
        id: 46,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/bu_khtr/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 47,
    name: "مختار الحاج",
    letter: "م",
    moshaf: [
      {
        id: 283,
        name: "حفص عن عاصم - مرتل",
        server:
          "https://server16.mp3quran.net/mukhtar_haj/Rewayat-Hafs-A-n-Assem/",
        surah_total: 112,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 48,
    name: "عادل ريان",
    letter: "ع",
    moshaf: [
      {
        id: 48,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/ryan/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 49,
    name: "عبدالبارئ الثبيتي",
    letter: "ع",
    moshaf: [
      {
        id: 49,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/thubti/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 5,
    name: "أحمد بن علي العجمي",
    letter: "أ",
    moshaf: [
      {
        id: 5,
        name: "حفص عن عاصم - مرتل",
        server: "https://server10.mp3quran.net/ajm/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 50,
    name: "عبدالبارئ محمد",
    letter: "ع",
    moshaf: [
      {
        id: 169,
        name: "المصحف المعلم - المصحف المعلم",
        server: "https://server12.mp3quran.net/bari/Almusshaf-Al-Mo-lim/",
        surah_total: 91,
        moshaf_type: 213,
        surah_list:
          "1,3,5,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 50,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/bari/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 51,
    name: "عبدالباسط عبدالصمد",
    letter: "ع",
    moshaf: [
      {
        id: 53,
        name: "حفص عن عاصم - مرتل",
        server: "https://server7.mp3quran.net/basit/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 52,
        name: "ورش عن نافع - مرتل",
        server: "https://server7.mp3quran.net/basit/Rewayat-Warsh-A-n-Nafi/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 51,
        name: "المصحف المجود - المصحف المجود",
        server: "https://server7.mp3quran.net/basit/Almusshaf-Al-Mojawwad/",
        surah_total: 114,
        moshaf_type: 222,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 54,
    name: "عبدالرحمن السديس",
    letter: "ع",
    moshaf: [
      {
        id: 54,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/sds/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 55,
    name: "عبدالعزيز الأحمد",
    letter: "ع",
    moshaf: [
      {
        id: 55,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/a_ahmed/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 56,
    name: "عبدالعزيز الزهراني",
    letter: "ع",
    moshaf: [
      {
        id: 56,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/zahrani/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 57,
    name: "عبدالله البريمي",
    letter: "ع",
    moshaf: [
      {
        id: 57,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/brmi/",
        surah_total: 69,
        moshaf_type: 11,
        surah_list:
          "1,19,23,24,25,31,32,36,49,50,55,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 58,
    name: "عبدالله البعيجان",
    letter: "ع",
    moshaf: [
      {
        id: 58,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/buajan/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 59,
    name: "عبدالله المطرود",
    letter: "ع",
    moshaf: [
      {
        id: 59,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/mtrod/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 6,
    name: "أحمد الحواشي",
    letter: "أ",
    moshaf: [
      {
        id: 6,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/hawashi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 60,
    name: "عبدالله بصفر",
    letter: "ع",
    moshaf: [
      {
        id: 60,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/bsfr/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 61,
    name: "عبدالله خياط",
    letter: "ع",
    moshaf: [
      {
        id: 61,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/kyat/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 62,
    name: "عبدالله عواد الجهني",
    letter: "ع",
    moshaf: [
      {
        id: 62,
        name: "حفص عن عاصم - مرتل",
        server: "https://server13.mp3quran.net/jhn/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 63,
    name: "عبدالله غيلان",
    letter: "ع",
    moshaf: [
      {
        id: 63,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/gulan/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 64,
    name: "عبدالرشيد صوفي",
    letter: "ع",
    moshaf: [
      {
        id: 258,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/soufi/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 65,
        name: "السوسي عن أبي عمرو - مرتل",
        server:
          "https://server16.mp3quran.net/soufi/Rewayat-Assosi-A-n-Abi-Amr/",
        surah_total: 114,
        moshaf_type: 71,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 64,
        name: "خلف عن حمزة - مرتل",
        server:
          "https://server16.mp3quran.net/soufi/Rewayat-Khalaf-A-n-Hamzah/",
        surah_total: 114,
        moshaf_type: 31,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 66,
    name: "عبدالمحسن الحارثي",
    letter: "ع",
    moshaf: [
      {
        id: 66,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/mohsin_harthi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 67,
    name: "عبدالمحسن القاسم",
    letter: "ع",
    moshaf: [
      {
        id: 67,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/qasm/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 68,
    name: "عبدالمحسن العسكر",
    letter: "ع",
    moshaf: [
      {
        id: 68,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/askr/",
        surah_total: 4,
        moshaf_type: 11,
        surah_list: "1,2,7,55",
      },
    ],
  },
  {
    id: 69,
    name: "عبدالمحسن العبيكان",
    letter: "ع",
    moshaf: [
      {
        id: 69,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/obk/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 7,
    name: "أحمد سعود",
    letter: "أ",
    moshaf: [
      {
        id: 7,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/saud/",
        surah_total: 30,
        moshaf_type: 11,
        surah_list:
          "85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 70,
    name: "عبدالهادي أحمد كناكري",
    letter: "ع",
    moshaf: [
      {
        id: 70,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/kanakeri/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 71,
    name: "عبدالودود حنيف",
    letter: "ع",
    moshaf: [
      {
        id: 71,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/wdod/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 72,
    name: "عبدالولي الأركاني",
    letter: "ع",
    moshaf: [
      {
        id: 72,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/arkani/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 73,
    name: "علي أبو هاشم",
    letter: "ع",
    moshaf: [
      {
        id: 73,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/abo_hashim/",
        surah_total: 14,
        moshaf_type: 11,
        surah_list: "11,12,18,19,21,25,50,51,52,53,54,55,56,57",
      },
    ],
  },
  {
    id: 74,
    name: "علي بن عبدالرحمن الحذيفي",
    letter: "ع",
    moshaf: [
      {
        id: 305,
        name: "شعبة  عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/hthfi/Rewayat-Sho-bah-A-n-Asim/",
        surah_total: 114,
        moshaf_type: 151,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 75,
        name: "قالون عن نافع - مرتل",
        server: "https://server9.mp3quran.net/huthifi_qalon/",
        surah_total: 114,
        moshaf_type: 51,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
      {
        id: 74,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/hthfi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 76,
    name: "علي جابر",
    letter: "ع",
    moshaf: [
      {
        id: 76,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/a_jbr/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 77,
    name: "علي حجاج السويسي",
    letter: "ع",
    moshaf: [
      {
        id: 77,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/hajjaj/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 78,
    name: "عماد زهير حافظ",
    letter: "ع",
    moshaf: [
      {
        id: 78,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/hafz/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 79,
    name: "عبدالعزيز التركي",
    letter: "ع",
    moshaf: [
      {
        id: 282,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/a_turki/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 8,
    name: "أحمد صابر",
    letter: "أ",
    moshaf: [
      {
        id: 8,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/saber/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 80,
    name: "عمر القزابري",
    letter: "ع",
    moshaf: [
      {
        id: 80,
        name: "ورش عن نافع - مرتل",
        server: "https://server9.mp3quran.net/omar_warsh/",
        surah_total: 114,
        moshaf_type: 21,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 81,
    name: "فارس عباد",
    letter: "ف",
    moshaf: [
      {
        id: 81,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/frs_a/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 82,
    name: "فهد العتيبي",
    letter: "ف",
    moshaf: [
      {
        id: 82,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/fahad_otibi/",
        surah_total: 8,
        moshaf_type: 11,
        surah_list: "50,56,69,72,73,74,75,76",
      },
    ],
  },
  {
    id: 83,
    name: "فهد الكندري",
    letter: "ف",
    moshaf: [
      {
        id: 83,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/kndri/",
        surah_total: 70,
        moshaf_type: 11,
        surah_list:
          "1,2,6,12,14,17,18,19,22,23,30,31,36,42,51,52,53,55,62,63,64,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 84,
    name: "فواز الكعبي",
    letter: "ف",
    moshaf: [
      {
        id: 84,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/fawaz/",
        surah_total: 49,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,21,22,23,25,26,27,28,29,30,33,35,36,39,40,41,49,54,55,56,57,58,59,62,63,66,67,73,78,87,109,112",
      },
    ],
  },
  {
    id: 85,
    name: "لافي العوني",
    letter: "ل",
    moshaf: [
      {
        id: 85,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/lafi/",
        surah_total: 84,
        moshaf_type: 11,
        surah_list:
          "3,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,27,28,29,30,31,32,33,35,36,37,38,39,40,41,42,43,44,45,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 86,
    name: "ناصر القطامي",
    letter: "ن",
    moshaf: [
      {
        id: 86,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/qtm/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 87,
    name: "نبيل الرفاعي",
    letter: "ن",
    moshaf: [
      {
        id: 87,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/nabil/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 88,
    name: "نعمة الحسان",
    letter: "ن",
    moshaf: [
      {
        id: 88,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/namh/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 89,
    name: "هاني الرفاعي",
    letter: "ه",
    moshaf: [
      {
        id: 89,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/hani/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 9,
    name: "أحمد نعينع",
    letter: "أ",
    moshaf: [
      {
        id: 9,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/ahmad_nu/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 90,
    name: "وليد الدليمي",
    letter: "و",
    moshaf: [
      {
        id: 90,
        name: "حفص عن عاصم - مرتل",
        server: "https://server8.mp3quran.net/dlami/",
        surah_total: 58,
        moshaf_type: 11,
        surah_list:
          "1,8,11,12,17,19,31,37,39,41,45,48,49,50,51,52,53,54,63,70,75,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 91,
    name: "وليد النائحي",
    letter: "و",
    moshaf: [
      {
        id: 91,
        name: "قالون عن نافع من طريق أبي نشيط - مرتل",
        server: "https://server9.mp3quran.net/waleed/",
        surah_total: 114,
        moshaf_type: 81,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 92,
    name: "ياسر الدوسري",
    letter: "ي",
    moshaf: [
      {
        id: 92,
        name: "حفص عن عاصم - مرتل",
        server: "https://server11.mp3quran.net/yasser/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 93,
    name: "ياسر القرشي",
    letter: "ي",
    moshaf: [
      {
        id: 93,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/qurashi/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 94,
    name: "ياسر الفيلكاوي",
    letter: "ي",
    moshaf: [
      {
        id: 94,
        name: "حفص عن عاصم - مرتل",
        server: "https://server6.mp3quran.net/fyl/",
        surah_total: 88,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,39,40,41,44,56,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,113,114",
      },
    ],
  },
  {
    id: 95,
    name: "ياسر المزروعي ",
    letter: "ي",
    moshaf: [
      {
        id: 95,
        name: "قراءة يعقوب الحضرمي بروايتي رويس وروح - مرتل",
        server: "https://server9.mp3quran.net/mzroyee/",
        surah_total: 114,
        moshaf_type: 91,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 96,
    name: "يحيى حوا",
    letter: "ي",
    moshaf: [
      {
        id: 96,
        name: "حفص عن عاصم - مرتل",
        server: "https://server12.mp3quran.net/yahya/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 97,
    name: "يوسف الشويعي",
    letter: "ي",
    moshaf: [
      {
        id: 97,
        name: "حفص عن عاصم - مرتل",
        server: "https://server9.mp3quran.net/yousef/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
  {
    id: 98,
    name: "عبدالله عبدل",
    letter: "ع",
    moshaf: [
      {
        id: 284,
        name: "حفص عن عاصم - مرتل",
        server: "https://server16.mp3quran.net/a_abdl/Rewayat-Hafs-A-n-Assem/",
        surah_total: 114,
        moshaf_type: 11,
        surah_list:
          "1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114",
      },
    ],
  },
];
export const morningAzkar = [
  {
    id: 1,
    arabic: "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ",
    count: 1,
  },
  {
    id: 2,
    arabic:
      "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
    count: 1,
  },
  {
    id: 3,
    arabic: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    count: 100,
  },
];

export const eveningAzkar = [
  {
    id: 1,
    arabic: "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ",
    count: 1,
  },
  {
    id: 2,
    arabic:
      "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ",
    count: 1,
  },
  {
    id: 3,
    arabic: "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
    count: 100,
  },
];
export const prayerTimeDescription = [
  {
    name: "الفجر",
    desc: "تبدأ مع بزوغ الفجر إيذانًا ببداية يوم جديد.",
  },
  {
    name: "الظهر",
    desc: "حين تزول الشمس عن كبد السماء، وقت الراحة والتقرب إلى الله.",
  },
  {
    name: "العصر",
    desc: "وقت في منتصف النهار، دعوة للتأمل والمداومة على العبادة.",
  },
  {
    name: "المغرب",
    desc: "عند غروب الشمس، لحظة ختام النهار وشكر النعم.",
  },
  {
    name: "العشاء",
    desc: "آخر صلاة في اليوم، تريح القلب قبل النوم.",
  },
];
//interfaces
export interface HadithProps {
  number: number;
  arab: string;
  id: string;
}
export interface AyahProps {
  ayahs: {
    number: number;
    audio: string;
    audioSecondary: string[];
    text: string;
    numberInSurah: number;
    juz: number;
    manzil: number;
    page: number;
    ruku: number;
    hizbQuarter: number;
    sajda: boolean;
  }[];
}
